src/main/resources/artillery.yml
config:
  target: 'http://localhost:8080'
  phases:
    - duration: 30
      arrivalRate: 20
      name: 'Warm up'
    - duration: 20
      arrivalRate: 20
      rampTo: 500
      name: 'Ramp up'
    - duration: 20
      arrivalRate: 500
      name: 'Sustained max load'
    - duration: 30
      arrivalRate: 500
      rampTo: 20
      name: 'Ramp down'
  payload:
    path: './payload.csv'
    fields:
      - 'userId'
      - 'couponId'
scenarios:
  - name: "쿠폰 발급"
    flow:
      - post:
          url: "/api/coupons/download"
          json:
            userId: "{{ userId }}"
            couponId: "{{ couponId }}"

#실행 명령어
#artillery run artillery.yml --record --key a9_tfZ7HbV_Uvf7qXrAE7SGC11faP6kTYOm
#해당 명령어 실행시 artillery.io 사이트에 접속하여 결과를 확인할 수 있음